In [216]:
import pandas as pd

In [217]:
df =pd.read_csv('students_data.csv')

In [218]:
df

    Student_id   math_score  reading_score  writing_score
0  student123as         NaN           80.0           90.0
1       ml1256w        50.0           70.0           10.0
2      as34erty        90.0            NaN            NaN

In [219]:
new_df =df.dropna(axis=0,how='any',thresh=3)

In [220]:
new_df

    Student_id   math_score  reading_score  writing_score
0  student123as         NaN           80.0           90.0
1       ml1256w        50.0           70.0           10.0

In [221]:
median_value=new_df['math_score'].median()

In [222]:
new_df['math_score'].fillna(value=median_value, inplace=True)

/Users/rk/opt/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:6245: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [223]:
new_df.math_score

0    50.0
1    50.0
Name: math_score, dtype: float64

In [224]:
new_df

    Student_id   math_score  reading_score  writing_score
0  student123as        50.0           80.0           90.0
1       ml1256w        50.0           70.0           10.0

In [225]:
new_df=new_df.replace('[A-Z a-z]','',regex=True)

In [226]:
new_df

  Student_id   math_score  reading_score  writing_score
0         123        50.0           80.0           90.0
1        1256        50.0           70.0           10.0

In [227]:
math_score=0.5
reading_score=0.2
writing_score=0.3

In [228]:
weight=[.5,.2,.3]

In [229]:
import numpy as np

In [230]:
df

    Student_id   math_score  reading_score  writing_score
0  student123as         NaN           80.0           90.0
1       ml1256w        50.0           70.0           10.0
2      as34erty        90.0            NaN            NaN

In [231]:
new_df

  Student_id   math_score  reading_score  writing_score
0         123        50.0           80.0           90.0
1        1256        50.0           70.0           10.0

In [232]:
weight

[0.5, 0.2, 0.3]

In [233]:
np.average(new_df[["math_score","reading_score","writing_score"]],axis=1,weights=weight)

array([68., 42.])

In [234]:
new_df[["math_score","reading_score","writing_score"]]

   math_score  reading_score  writing_score
0        50.0           80.0           90.0
1        50.0           70.0           10.0

In [235]:
new_df['weighted_Average']=np.average(new_df[["math_score","reading_score","writing_score"]],axis=1,weights=weight)

In [236]:
new_df

  Student_id   math_score  reading_score  writing_score  weighted_Average
0         123        50.0           80.0           90.0              68.0
1        1256        50.0           70.0           10.0              42.0